#!/usr/bin/env python
# _*_ coding: utf-8
# author linbin Date 2018-05-04

###本文的目的是画睡眠曲线图


anno_labels = [1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2,
               2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
               2, 2, 2, 2, 2, 2, 3, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3,
               3, 3, 3, 2, 2, 2, 3, 3, 3, 2, 0, 0, 1, 0, 1, 2, 1, 2, 2, 2, 2, 2,
               2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 2, 2, 0,
               0, 0, 1, 1, 1, 1, 2, 2, 2, 2, 1, 0, 0, 1, 1, 1, 1, 1, 2, 1, 2, 2,
               2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 2, 2, 3, 2, 3, 2, 2,
               3, 2, 2, 3, 3, 3, 3, 3, 3, 3, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 2,
               2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
               2, 2, 2, 2, 1, 2, 2, 2, 2, 2, 2, 2, 2, 4, 4, 4, 4, 4, 4, 4, 4, 4,
               4, 4, 1, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 2,
               2, 2, 2, 2, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1,
               2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 2, 2, 2,
               3, 2, 3, 3, 2, 3, 3, 3, 3, 2, 2, 2, 2, 3, 3, 3, 3, 3, 2, 2, 2, 2,
               2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
               2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 0, 1, 1, 2, 2, 2, 2, 2,
               2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
               2, 2, 2, 2, 2, 2, 2, 2, 2, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 0, 0,
               1, 1, 2, 2, 2, 1, 1, 2, 2, 2, 2, 2, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4,
               4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4,
               4, 4, 4, 4, 4, 4, 4, 4, 4, 0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4,
               4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4,
               4, 4, 4, 4, 4, 4, 4, 4, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
               2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
               2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 2, 2, 2, 1, 1, 1, 2, 2, 2, 2,
               2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
               2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 2, 2, 2, 2, 2, 2, 3, 2, 2, 2,
               1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 2, 2, 2,
               2, 2, 2, 2, 2, 2, 2, 2, 3, 2, 2, 0, 1, 2, 2, 2, 2, 2, 2, 4, 4, 4,
               4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4,
               4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 0, 1, 1, 4, 4, 4, 4, 4, 4, 4, 0, 0,
               0, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
               2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
               2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1, 2, 2, 2, 2, 2, 2,
               2, 2, 2, 1, 1, 2, 2, 2, 2, 2, 2, 2, 1, 1, 2, 2, 2, 2, 2, 2, 2, 4,
               4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 1,
               1, 1, 1, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4,
               1, 4, 4, 4, 4, 4, 1, 4, 4, 4, 4, 4, 4, 4, 4, 4, 1, 1]

results = [1, 1, 1, 1, 2, 1, 2, 1, 1, 1, 1, 2, 2, 1, 1, 2, 2, 2, 2, 2, 2, 2,
           2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
           2, 2, 2, 2, 3, 2, 3, 3, 2, 3, 3, 3, 0, 2, 3, 3, 3, 3, 3, 3, 3, 3,
           2, 3, 1, 1, 2, 2, 2, 2, 1, 4, 0, 4, 1, 0, 4, 2, 4, 2, 2, 2, 1, 2,
           2, 2, 2, 2, 2, 1, 1, 2, 2, 2, 2, 4, 2, 2, 2, 2, 2, 2, 0, 1, 2, 0,
           0, 0, 1, 1, 1, 2, 2, 1, 2, 2, 1, 1, 1, 1, 1, 4, 1, 1, 2, 1, 2, 2,
           2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 2, 2, 2,
           3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 0, 3, 3, 0, 1, 0,
           2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 2, 2, 2, 2, 2, 2, 2, 1, 4, 2, 2, 2,
           0, 2, 2, 2, 1, 2, 2, 2, 2, 2, 2, 2, 2, 4, 4, 1, 4, 4, 4, 4, 4, 4,
           4, 4, 1, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 2,
           2, 2, 2, 0, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
           2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 0, 2, 2, 2,
           2, 2, 3, 2, 2, 2, 0, 3, 3, 2, 2, 3, 2, 0, 2, 2, 3, 1, 2, 2, 2, 2,
           2, 2, 2, 2, 2, 3, 2, 2, 2, 2, 4, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
           2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 0, 1, 2, 1, 2, 4, 2, 2,
           2, 2, 2, 2, 2, 2, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
           2, 2, 2, 2, 2, 2, 2, 2, 2, 0, 2, 2, 4, 2, 2, 2, 2, 2, 2, 1, 1, 0,
           1, 1, 4, 2, 2, 1, 1, 2, 2, 2, 2, 2, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4,
           4, 4, 4, 1, 4, 4, 4, 2, 4, 4, 4, 4, 4, 1, 4, 1, 4, 4, 4, 4, 4, 4,
           4, 4, 4, 4, 4, 4, 4, 4, 4, 0, 2, 2, 4, 1, 1, 4, 4, 4, 4, 1, 4, 1,
           1, 1, 4, 2, 4, 4, 4, 4, 1, 4, 4, 2, 4, 4, 4, 4, 4, 4, 4, 1, 4, 4,
           4, 4, 4, 4, 4, 1, 1, 4, 1, 1, 4, 2, 4, 1, 2, 2, 2, 2, 2, 2, 2, 2,
           2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
           2, 2, 0, 2, 2, 2, 2, 2, 2, 2, 2, 3, 2, 2, 2, 1, 1, 1, 2, 2, 2, 2,
           2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
           2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 0, 2, 2, 3, 2, 2,
           1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1, 2, 2, 2,
           2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 0, 1, 2, 2, 2, 2, 2, 2, 4, 1, 2,
           4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 1, 4, 4, 4, 4, 4, 4,
           4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 0, 4, 1, 4, 1, 4, 4, 4, 4, 4, 4, 0,
           0, 1, 1, 4, 2, 2, 2, 2, 2, 1, 2, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
           2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
           2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 1, 2, 1, 2, 2, 2, 2,
           2, 2, 2, 1, 1, 2, 2, 2, 2, 2, 2, 2, 0, 2, 2, 2, 2, 2, 2, 1, 2, 1,
           4, 4, 1, 4, 4, 4, 1, 1, 4, 4, 1, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4,
           1, 1, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 2, 4, 4, 0, 4,
           1, 4, 4, 4, 4, 1, 1, 1, 1, 4, 4, 4, 4, 4, 4, 4, 1, 1]

# import matplotlib.pyplot as plt
#
# from pylab import *
# # 创建一个 8 * 6 点（point）的图，并设置分辨率为 80
# figure(figsize=(8,3), dpi=80)
# # 创建一个新的 1 * 1 的子图，接下来的图样绘制在其中的第 1 块（也是唯一的一块）
# subplot(1,1,1)
# X = np.linspace(-np.pi, np.pi, 256,endpoint=True)
# C,S = np.cos(X), np.sin(X)
# # 绘制余弦曲线，使用蓝色的、连续的、宽度为 1 （像素）的线条
# plot(X, C, color="blue", linewidth=1.0, linestyle="-")
# # 绘制正弦曲线，使用绿色的、连续的、宽度为 1 （像素）的线条
# plot(X, S, color="green", linewidth=1.0, linestyle="-")
# # 设置横轴的上下限
# xmin, xmax = xlim()
# xlim( (xmin, xmax) )
# xlim( xmin, xmax )
# xlim(-4.0,4.0)
# xlim((xmin,max))
# # 设置横轴记号
# xticks(np.linspace(-4,4,9,endpoint=True))
# # 设置纵轴的上下限
# ylim(-1.0,1.0)
# # 设置纵轴记号
# yticks(np.linspace(-1,1,5,endpoint=True))
# show()

import matplotlib.pyplot as plt
import numpy as np
#指定图形的字体
font = {'family' : 'serif',
        'color'  : 'black',
       # 'weight' : 'normal',
        'weight' : 'roman',
        'size'   : 14,}
font_tick = {'family' : 'serif',
        'color'  : 'black',
        'weight' : 'normal',
        'size'   : 12,}
#设置图片的大小
plt.figure(figsize=(12,8), dpi=70)
plt.subplot(2,1,1)
plt.plot(anno_labels, color="blue", linewidth=1.0)
plt.xlim( (0, 832) )
###设置刻度的字体大小
plt.xticks(np.linspace(0,800,5,endpoint=True),fontsize=12)
ax=plt.gca()
ax.set_yticks(np.linspace(0,4,5))
ax.set_yticklabels( ('W', 'N1', 'N2', 'N3', 'R'), fontdict=font_tick)
# 设置label
ax.set_ylabel('Sleep stage', fontdict=font)
ax.set_xlabel('Epoch(120 epochs = 1 hour)', fontdict=font)
plt.title('Subject 6 - Hypnogram manually scored by a sleep expert', fontdict=font)
#设置两个子图之间的间隔
#plt.tight_layout(pad=3)
plt.subplot(2,1,2)
plt.plot(results, color="blue", linewidth=1.0)
plt.xlim( (0, 832) )
plt.xticks(np.linspace(0,800,5,endpoint=True),fontsize=12)
ax=plt.gca()
ax.set_yticks(np.linspace(0,4,5))
ax.set_yticklabels( ('W', 'N1', 'N2', 'N3', 'R'), fontdict=font_tick)
# 设置label
ax.set_ylabel('Sleep stage', fontdict=font)
ax.set_xlabel('Epoch(120 epochs = 1 hour)', fontdict=font)
plt.title('Subject 6 - Hypnogram automatically scored by CNN', fontdict=font)
#子图之间的间距
plt.tight_layout(pad=3)
plt.show()


# # 设置刻度字体大小
# plt.xticks(fontsize=20)
# plt.yticks(fontsize=20)
# # 设置坐标标签字体大小
# ax.set_xlabel(..., fontsize=20)
# ax.set_ylabel(..., fontsize=20)
# # 设置图例字体大小
# ax.legend(..., fontsize=20)

# # 配置一下坐标刻度等
# ax = plt.gca()
# ax.set_xticks(np.linspace(0, 1, 9))
# ax.set_xticklabels(('275', '280', '285', '290', '295', '300', '305', '310', '315'))
# ax.set_yticks(np.linspace(0, 1, 8))
# ax.set_yticklabels(('0.60', '0.65', '0.70', '0.75', '0.80', '0.85', '0.90', '0.95'))

# 显示colorbar
# cbar = plt.colorbar(gci)
# cbar.set_label('$T_B(K)$', fontdict=font)
# cbar.set_ticks(np.linspace(160, 300, 8))
# cbar.set_ticklabels(('160', '180', '200', '220', '240', '260', '280', '300'))
# # 设置label
# ax.set_ylabel('Land Surface Emissivity', fontdict=font)
# ax.set_xlabel('Land Surface Temperature(K)', fontdict=font)  # 陆地地表温度LST
# # 设置title
# titleStr = '$T_B$ for Freq = ' + str(float(fp[1:-1]) * 0.01) + 'GHz'
# plt.title(titleStr)
# figname = fp + '.png'
# plt.savefig(figname)
# plt.clf()  # 清除图形

# pl.plot(x, y,label="$sin(x)$")
# # 设置图的底边距
# pl.subplots_adjust(bottom = 0.15)